Repository: dimag0g/flycfg
Catalog: locale/flycfg.*.po
Languages: de, fr, ru

# flycfggui.rccalcstat
source: Calculating config status
de: Berechnung des Konfigstatus
fr: Calcul de l'état de la configuration
ru: Расчет состояния конфигурации

# flycfggui.rcconnecting
source: Connecting to
ru: Подключение к

# flycfggui.rcconnfail
source: Failed to connect to
ru: Не удалось подключиться к

# flycfggui.rcconnnoport
source: No serial port selected!
de: Keine serielle Schnittstelle ausgewählt!
fr: Aucun port série n'est sélectionné !
ru: Последовательный порт не выбран!

# flycfggui.rcloadcancel
source: Loading cancelled
de: Laden abgebrochen
fr: Chargement annulé
ru: Загрузка отменена

# flycfggui.rcloaddone
source: Config loaded from
ru: Конфигурация загружена из

# flycfggui.rcloadfail
source: Could not load
ru: Не удалось прочитать

# flycfggui.rcloadnofile
source: File not found:
ru: Файл не найден:

# flycfggui.rcreadautofail
source: Failed read autocomplete data from FC on
ru: Не удалось считать данные автозаполнения КП на

# flycfggui.rcreaddifffail
source: Failed read diff config from FC on
ru: Не удалось прочитать разницу конфигураций КП на

# flycfggui.rcreaddone
source: Received active config from FC on
ru: Получена активная конфигурация КП на

# flycfggui.rcreaddumpfail
source: Failed read config dump from FC on
ru: Не удалось прочитать дамп конфигурации КП на

# flycfggui.rcreadingauto
source: Reading autocomplete data
de: Lesen von Autovervollständigungsdaten
fr: Lecture des données de l'autocomplétion
ru: Чтение данных автозаполнения

# flycfggui.rcreadingdiff
source: Reading config diff
de: Lesen von Konfigurationsdifferenz
fr: Lecture des différences de configuration
ru: Чтение различий в конфигурации

# flycfggui.rcreadingdump
source: Reading config dump
de: Lesen des Konfigurationsdumps
fr: Lecture de la configuration complete
ru: Чтение дампа конфигурации

# flycfggui.rcreadingres
source: Reading active resources
de: Lesen von aktiven Ressourcen
fr: Lecture de ressources actives
ru: Чтение активных ресурсов

# flycfggui.rcreadresfail
source: Failed read active resources from FC on
ru: Не удалось считать активные ресурсы из КП на

# flycfggui.rcresetmessage
source: Reset the FC config to default and load it?
de: Wollen Sie die FR-Konfiguration auf die Standardwerte zurücksetzen und laden?
fr: Réinitialiser la configuration de la FC à sa valeur par défaut et la charger ?
ru: Сбросить конфигурацию КП на значения по умолчанию и загрузить ее?

# flycfggui.rcresetting
source: Resetting to defaults
de: Der FR wird Zurückgesetzt
fr: Réinitialisation aux valeurs par défaut
ru: Сброс на настройки по умолчанию

# flycfggui.rcresettitle
source: Confirm reset
de: Rücksetzen bestätigen
fr: Confirmer la réinitialisation
ru: Подтвердите сброс

# flycfggui.rcsavecancel
source: Saving cancelled
de: Speichern abgebrochen
fr: Enregistrement annulé
ru: Сохранение отменено

# flycfggui.rcsavedone
source: Config saved to
ru: Конфигурация сохранена в

# flycfggui.rcsaveempty
source: Nothing to save!
de: Nichts zu speichern!
fr: Rien à enregistrer!
ru: Нечего сохранять!

# flycfggui.rcsavefail
source: Could not save
ru: Не удалось записать

# flycfggui.rcsaving
source: Saving FC config
de: FR-Konfiguration wird gespeichert
fr: Enregistrement de la configuration de la FC
ru: Сохранение конфигурации КП

# flycfggui.rcwriteempty
source: Nothing to write!
de: Nichts zu schreiben!
fr: Rien à écrire !
ru: Нечего писать!

# flycfggui.rcwritefail
source: Failed to write
ru: Не удалось записать

# flycfggui.rcwriting
source: Writing current config to FC
de: Aktuelle Konfiguration in FR schreiben
fr: Écriture de la configuration actuelle dans le FC
ru: Запись текущей конфигурации в FC

source: Beeper
de: Piepser
fr: Alarme
ru: Пищалка

source: Configuration File
de: Konfigurationsdatei
fr: Fichier de configuration
ru: Файл конфигурации

source: Current config
de: Aktuelle Konfiguration
fr: Configuration actuelle
ru: Текущая конфигурация

source: Debug
fr: Débogage
ru: Отладка

source: Flight Controller
de: Flugregler
fr: Contrôleur de vol
ru: Контроллер Полёта

source: Features
de: Funktionen
fr: Fonctions
ru: Функции

source: Load
de: Laden
fr: Charger
ru: Загрузка

source: Load the current configuration from a file
de: Aktuellen Konfiguration aus einer Datei Laden
fr: Chargement de la configuration actuelle à partir d'un fichier
ru: Загрузка текущей конфигурации из файла

source: Save
de: Speichern
fr: Enregistr.
ru: Запись

source: Write the current configuration to a file
de: Aktuellen Konfiguration in eine Datei Schreiben
fr: Ecrire la configuration actuelle dans un fichier
ru: Запись текущей конфигурации в файл

source: <search>
de: <Suche>
fr: <recherche>
ru: <поиск>

source: Find
de: Finden
fr: Trouver
ru: Найти

source: Selectable Features:
de: Wählbare Funktionen:
ru: Выбираемые функции:

source: Legend:
de: Legende:
fr: Légende:
ru: Легенда:

source: Feature resources/settings:
de: Ressourcen/Einstellungen:
fr: Ressources/paramètres :
ru: Ресурсы/параметры:

source: Function:
de: Funktion:
fr: Fonction:
ru: Функция:

source: Baudrate:
ru: Скорость:

source: Serial ports:
de: Serielle Ports:
fr: Ports série :
ru: Доступные порты:

source: Serial resources:
de: Ressourcen:
fr: Ressources ports série :
ru: Ресурсы порта:

source: Slot:
ru: Слот:

source: Beeper alarms:
de: Piepser-Alarme:
fr: Alarmes sonores :
ru: Cигналы тревоги:

source: Beeper resources/settings:
de: Ressourcen/Einstellungen:
fr: Ressources/paramètres :
ru: Ресурсы/настройки:

source: Mode:
ru: Режим:

source: Channel:
de: Kanal:
fr: Chaîne:
ru: Канал:

source: Static Features:
de: Statische Funktionen:
fr: Fonctions statiques :
ru: Основные функции:

source: Range:
ru: Пределы:

source: Clear
de: Löschen
fr: Effacer
ru: Очистить

source: Log
de: Protokoll
fr: Journal
ru: Лог

source: Reset to Defaults
de: Auf Standardwerte zurücksetzen
fr: Réinitialisation aux valeurs par défaut
ru: Сбросить

source: Write All
de: Alles schreiben
fr: Ecrire Tout
ru: Записать всё

source: Write Custom
de: Benutzerdefiniert schreiben
fr: Ecrire Perso
ru: Записать измененные

source: Write Selected
de: Auswahl schreiben
fr: Ecrire Selection
ru: Записать выбранные

source: Write Unsaved
de: Ungesichertes schreiben
fr: Ecrire Modifs
ru: Записать несохранённые

source: Write Valid
de: Gültig schreiben
fr: Ecrire Valide
ru: Записать корректные

source: Mode Channel
fr: Chaîne du mode
ru: Канал режима

source: Mode Name
fr: Nom du mode
ru: Название режима

source: Modes
ru: Режимы

# tflycfgform.serialbaudbox.text
source: NONE
fr: RIEN
ru: НЕТ

# tflycfgform.serialfnbox.text
source: NONE
fr: RIEN
ru: НЕТ

source: Serial
fr: Port série
ru: Порт

source: Ready
de: Bereit
fr: Prêt
ru: Готов

source: No device
de: Kein Gerät
fr: Aucun appareil
ru: Нет КП

source: Read
de: Lesen
fr: Lire
ru: Чтение

source: Read the active configuration from the FC
de: Lesen der aktiven Konfiguration aus dem FR
fr: Lire la configuration active du FC
ru: Считывание активной конфигурации с КП

source: Write...
de: Schreiben
fr: Ecrire...
ru: Запись...

source: Write the current configuration to the FC
de: Schreiben der aktuellen Konfiguration in den FR
fr: Écriture de la configuration actuelle dans le FC
ru: Запись текущей конфигурации в файл

# flycfggui.rcconnecting
source: Connecting to %s
de: Verbindung mit %s
fr: Connexion à %s

# flycfggui.rcconnfail
source: Failed to connect to %s
de: Verbindung zu %s fehlgeschlagen
fr: Échec de la connexion à %s

# flycfggui.rcloaddone
source: Config loaded from %s
de: Konfiguration von %s geladen
fr: Config chargée à partir de %s

# flycfggui.rcloadfail
source: Could not load %s
de: Konnte %s nicht laden
fr: Impossible de charger %s

# flycfggui.rcloadnofile
source: File not found: %s
de: Datei nicht gefunden: %s
fr: Fichier non trouvé : %s

# flycfggui.rcreadautofail
source: Failed read autocomplete data from FC on %s
de: Lesen der Autovervollständigungsdaten von FR auf %s fehlgeschlagen
fr: Échec de lecture des données de l'autocomplétion à partir de %s

# flycfggui.rcreaddifffail
source: Failed read diff config from FC on %s
de: Lesen der Diff-Konfiguration von FR auf %s fehlgeschlagen
fr: Échec de lecture de la configuration de FC sur %s

# flycfggui.rcreaddone
source: Received active config from FC on %s
de: Empfangene aktive Konfiguration von FC auf %s
fr: Réception de la configuration active de FC sur %s

# flycfggui.rcreaddumpfail
source: Failed read config dump from FC on %s
de: Lesen des Konfigurationsdump von FR auf %s fehlgeschlagen
fr: Échec de lecture de la configuration FC complete sur %s

# flycfggui.rcreadresfail
source: Failed read active resources from FC on %s
de: Lesen aktiver Ressourcen von FC auf %s fehlgeschlagen
fr: Échec de lecture des ressources actives de FC sur %s

# flycfggui.rcsavedone
source: Config saved to %s
de: Konfiguration in %s gespeichert
fr: Configuration enregistrée dans %s

# flycfggui.rcsavefail
source: Could not save %s
de: Konnte %s nicht speichern
fr: Impossible d'enregistrer %s

# flycfggui.rcwritefail
source: Failed to write %s
de: Konnte %s nicht schreiben
fr: Échec de l'écriture : %s

source: Inactive
de: Inaktiv
fr: Inactif

source: Custom
fr: Perso

source: Invalid
de: Ungültig
fr: Invalide

source: Default
de: Standard

source: Unsaved
de: Ungesp.
